# pandas concat() method

In [1]:
import pandas as pd

In [2]:
sr1=pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [3]:
sr2=pd.Series([3,3,5])
sr2

0    3
1    3
2    5
dtype: int64

In [4]:
pd.concat([sr1,sr2]) #twp equal series

0    0
1    1
2    2
0    3
1    3
2    5
dtype: int64

In [5]:
sr2=pd.Series([3,3,5,4,5,7])
sr2

0    3
1    3
2    5
3    4
4    5
5    7
dtype: int64

In [6]:
pd.concat([sr1,sr2]) #twp unequal series

0    0
1    1
2    2
0    3
1    3
2    5
3    4
4    5
5    7
dtype: int64

In [10]:
df1=pd.DataFrame({'ID':[1,2,3,4],
             'Name':['A',"B",'C','D'],'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [11]:
df2=pd.DataFrame({'ID':[1,2,3,4],
             'Name':['E',"F",'G','H'],'Class':[5,6,7,8]})
df2

   ID Name  Class
0   1    E      5
1   2    F      6
2   3    G      7
3   4    H      8